## CA PRODUCTION PROVISION PLAN
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_CA_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_CA_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_CA_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC9f951863c83dc61cf94bdc12a12270a5/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC9f951863c83dc61cf94bdc12a12270a5/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC9f951863c83dc61cf94bdc12a12270a5/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws_monitoring.aws_cloudwatch_metric_alarm.alarm_twilio_email will be destroyed
  # (because aws_cloudwatch_metric_alarm.alarm_twilio_email is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "alarm_twilio_email" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:712893914485:AWS-production-alarms",
        ] -> null
      - alarm_description         = "Kids Help Phone (Production) received at least 1 Twilio errors in the past hour. Sent email notification." -> null
      - alarm_name                = "production-twilio-reporter-ca-email" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:712893914485:alarm:production-twilio-reporter-ca-email" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 1 -> null
      - dimensions                = {
          - "Name"  = "Account"
          - "Value" = "CA_PRODUCTION"
        } -> null
      - evaluation_periods        = 1 -> null
      - id                        = "production-twilio-reporter-ca-email" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "PRODUCTION ERROR x ACCOUNT" -> null
      - namespace                 = "Twilio Reporter" -> null
      - ok_actions                = [] -> null
      - period                    = 3600 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # module.github[0].github_actions_secret.flex_twilio_account_sid will be created
  + resource "github_actions_secret" "flex_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "CA_PROD_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_auth_token will be created
  + resource "github_actions_secret" "flex_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "CA_PROD_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_account_sid will be created
  + resource "github_actions_secret" "serverless_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "CA_PROD_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_auth_token will be created
  + resource "github_actions_secret" "serverless_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "CA_PROD_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.webchat_serverless_url will be created
  + resource "github_actions_secret" "webchat_serverless_url" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "webchat"
      + secret_name     = "CA_PROD_SERVERLESS_URL"
      + updated_at      = (known after apply)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["988_en"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "988 English"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "routing.skills HAS '988En'"
      + task_order               = (known after apply)
      + workspace_sid            = "WSf2e3f00412fa8cc45f4318b45a870ea5"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["988_fr"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "988 French"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "routing.skills HAS '988Fr'"
      + task_order               = (known after apply)
      + workspace_sid            = "WSf2e3f00412fa8cc45f4318b45a870ea5"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["988_ns_fr"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "988 NS French"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "routing.skills HAS '988NSFr'"
      + task_order               = (known after apply)
      + workspace_sid            = "WSf2e3f00412fa8cc45f4318b45a870ea5"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - filters = [
                      - {
                          - expression           = "flexOutboundDialerTargetWorker != null"
                          - filter_friendly_name = "Dialpad"
                          - targets              = [
                              - {
                                  - expression = "task.flexOutboundDialerTargetWorker == worker.contact_uri"
                                  - queue      = "WQ9360fa79f63cff7b430276d36cc29bff"
                                },
                            ]
                        },
                      - {
                          - expression           = "channelType=='web' AND e2eTestMode=='true'"
                          - filter_friendly_name = "E2E Test"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ3be829ea7ec066243ae451e16db76e63"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+12268878353', '+18663931921'] AND interpreter CONTAINS \"indigenous\")"
                          - filter_friendly_name = "Indigenous"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ9b052e6f56db438435b63805dd85e6cb"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+12268878353', '+18663931921'] AND interpreter CONTAINS \"fr\")"
                          - filter_friendly_name = "French Interpreter"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ4a49c8237a6f62ce7bd8784d84df743d"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+12268878353', '+18663931921'] AND language CONTAINS \"en-CA\") OR isContactlessTask == true"
                          - filter_friendly_name = "KHP English"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ90d837f52891cf3768fec19069da9b2f"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+12268878353', '+18663931921'] AND language CONTAINS \"fr-CA\")"
                          - filter_friendly_name = "KHP French"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ4e3db3fbbeb2321e22dfdbf7a703d1a6"
                                  - timeout    = 0
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+12268878353', '+18663931921'] AND interpreter CONTAINS \"main\")"
                          - filter_friendly_name = "KHP Interpreter"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQa7219cf431a904bf6cef104b8e1c7cf7"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+13656546095', '+13656546120'] AND language CONTAINS \"en-CA\")"
                          - filter_friendly_name = "G2T ON English"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQc774f3a1d09a93ae8eaba80be323e600"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+13656546095', '+13656546120'] AND language CONTAINS \"fr-CA\")"
                          - filter_friendly_name = "G2T ON French"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ61ef6d908e82fe48bb90bd259099260e"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+13656546032', '+13656546120'])"
                          - filter_friendly_name = "G2T Interpreter"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQb003ea620f2a0d7d2fbb5049a2b24762"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+15878043655', '+15878044316'] AND language CONTAINS \"en-CA\")"
                          - filter_friendly_name = "G2T NS English"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQe4336d184540020b222d80ab28805938"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+15878043655', '+15878044316'] AND language CONTAINS \"fr-CA\")"
                          - filter_friendly_name = "G2T NS French"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQe831ab19f57512b0fbcd3e4228df099e"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+15877412408', '+15876095765'] AND language CONTAINS \"en-CA\")"
                          - filter_friendly_name = "AB211 English"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ4a65b58f44f528b8f2a3ac84e539dac4"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+15877412408', '+15876095765'] AND language CONTAINS \"fr-CA\")"
                          - filter_friendly_name = "AB211 French"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQd38b69a5ac03ba2cbe5275359b862688"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+13656540516', '+13656520724'] AND language CONTAINS \"en-CA\")"
                          - filter_friendly_name = "HC English"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ278e3efcb807d8b3e2f2fb5e0627f254"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+13656540516', '+13656520724'] AND language CONTAINS \"fr-CA\")"
                          - filter_friendly_name = "HC French"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ68c87b0132af573d34ddc0acfb68b35f"
                                },
                            ]
                        },
                      - {
                          - expression           = "(to IN ['+18252547345'])"
                          - filter_friendly_name = "Training"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ492a7793c2d881eee1c7aa3b18548ff5"
                                },
                            ]
                        },
                      - {
                          - expression           = "channelType=='web' AND (language CONTAINS \"en-CA\" OR language=='')"
                          - filter_friendly_name = "Chat English"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQf659c270357487d2372a657b649a3a7a"
                                },
                            ]
                        },
                      - {
                          - expression           = "channelType=='web' AND language CONTAINS \"fr-CA\""
                          - filter_friendly_name = "Chat French"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ43733e6ff913f64edafb10b041804c6e"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WSf2e3f00412fa8cc45f4318b45a870ea5/WWf88dc2e079f1c57fb3f98753d6121b79"
        # (4 unchanged attributes hidden)
    }

Plan: 9 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ task_router_master_workflow_sid       = "WWf88dc2e079f1c57fb3f98753d6121b79" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master = "WWf88dc2e079f1c57fb3f98753d6121b79" -> (known after apply)
    }
